InformationRegisters/РасчетТорговогоСбора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РасчетТорговогоСбора</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаСбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЛьготы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрационныхДанных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РасшифровкаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыТорговыхТочек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТорговойТочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТорговыхТочек</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидТорговойДеятельности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТорговойДеятельностиОблагаемыеСбором</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеПользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияПользованияТорговойТочкой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостановкаНаУчетВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПостановкаНаУчетВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОбъектаНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНедвижимостиОблагаемыхТорговымСбором</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КадастровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьТорговогоЗала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНалоговойЛьготы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЛьготы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уведомление</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодачиУведомления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийТорговыеТочки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийТорговыеТочки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПараметров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеСУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтавки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/РасчетТорговогоСбора/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРегистрРасчетТорговогоСбора(Параметры) Экспорт
	
	// Рассчитаем суммы торгового сбора для периода каждой регоперации чтобы заполнить регистр РасчетТорговогоСбора
	// Для этого:
	// 1. Отберем все регоперации у которых нет записей регистра
	// 2. Рассчитаем суммы налога на дату каждой регоперации, с учетом требования, что изменения параметров торговых точек которые приводят к увеличению суммы налога, 
	//     учитываются в периоде изменения, а изменения параметров торговых точек, которые приводят к уменьшению суммы налога, учитываются только со след. налогового периода. 
	//     Поэтому для расчета суммы сбора нужно получить максимальную сумму из суммы налога рассчитанной по параметрам торговой точки на начало периода и всех сумм налога за период.
	// 2.1 Определим последнюю запись параметров (и сумму налога) до начала регпериода. 
	// 2.2 Определим запись параметров в течении регпериода которая привела к максимальной сумме налога в течении периода
	// 2.3. Определим ту запись параметров (из п. 2.1 и 2.2) сумма налога в которой максимальна.
	// 3. Также определим дату изменения параметров торговой точки, которые привели к установке текущей суммы сбора. Эта информация потребуется для справки расчета
	//    Это будет самая поздняя запись параметров с такой суммой сбора - для случая когда параметры несколько раз увеличивались и уменьшались в течении периода.
	// Таким образом в регистре будет хранится как сумма сбора, так и дата сведений из регистра ПараметрыТорговыхТочек по которым эта сумма сбора была рассчитана
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТорговыйСборПереопределяемый.ТекстЗапросаРасчетТорговогоСбора();
	ВыборкаПоРегистратору = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбработаноЗаписей = 0;
	НеУдалосьОбработать = 0;
	
	Пока ВыборкаПоРегистратору.Следующий() Цикл
		НачатьТранзакцию();
		
		Попытка
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("Документ.РегламентнаяОперация");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаПоРегистратору.РегламентнаяОперацияСсылка);
			
			Блокировка.Заблокировать();
			
			ДокументОбъект = ВыборкаПоРегистратору.РегламентнаяОперацияСсылка.ПолучитьОбъект();
			Если ДокументОбъект = Неопределено Тогда
			
				ШаблонСообщения = НСтр("ru = 'Не удалось получить объект по ссылке
		                               |%1';
		                               |en = 'Cannot get the object by link
		                               |%1'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаПоРегистратору.РегламентнаяОперацияСсылка);
				
				ЗаписьЖурналаРегистрации(
					ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.РегистрыСведений.РасчетТорговогоСбора,
					, 
					ТекстСообщения);
					
				Продолжить;
			
			КонецЕсли;
			
			НаборЗаписейРасчетТорговогоСбора = РегистрыСведений.РасчетТорговогоСбора.СоздатьНаборЗаписей();
			НаборЗаписейРасчетТорговогоСбора.Отбор.Регистратор.Установить(ВыборкаПоРегистратору.РегламентнаяОперацияСсылка);
			
			ВыборкаПоЗаписям = ВыборкаПоРегистратору.Выбрать();
			Пока ВыборкаПоЗаписям.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(НаборЗаписейРасчетТорговогоСбора.Добавить(), ВыборкаПоЗаписям);
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейРасчетТорговогоСбора);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			
			ОбработаноЗаписей = ОбработаноЗаписей + 1;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ШаблонСообщения = НСтр("ru = 'Не удалось создать записи расчета торгового сбора по причине
	                               |%1';
	                               |en = 'Cannot create records for sales charge calculation due to
	                               |%1'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.РасчетТорговогоСбора,
				, 
				ТекстСообщения);
				
			НеУдалосьОбработать = НеУдалосьОбработать + 1;
		КонецПопытки;
	КонецЦикла; 
	
	Если НеУдалосьОбработать > 0 Тогда 
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре РегистрСведений.РасчетТорговогоСбора.ЗаполнитьРегистрРасчетТорговогоСбора() не удалось обработать %1 из %2 записей.';
				|en = 'The РегистрСведений.РасчетТорговогоСбора.ЗаполнитьРегистрРасчетТорговогоСбора() procedure failed to update %1 out of %2 records.'"),
				НеУдалосьОбработать, НеУдалосьОбработать+ОбработаноЗаписей);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
		Метаданные.РегистрыСведений.РасчетТорговогоСбора, ,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Процедура РегистрСведений.РасчетТорговогоСбора.ЗаполнитьРегистрРасчетТорговогоСбора() обработала %1 записей.';
					|en = 'The РегистрСведений.РасчетТорговогоСбора.ЗаполнитьРегистрРасчетТорговогоСбора() procedure processed %1 records.'"), ОбработаноЗаписей));
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Истина;
КонецПроцедуры

// Функция проверяет, обработан ли документ процедурой обновления (см. ЗаполнитьРегистрРасчетТорговогоСбора).
//  Определена в свойстве ПроцедураПроверки соответствующего обработчика обновления.
//
// Параметры:
//  Параметры - Структура - см. документацию к БСП
// 
// Возвращаемое значение:
//   - Булево - если Истина, то можно редактировать и записывать данные, Ложь - данные недоступны, пока не будут обработаны процедурой обновления.

Функция РегистрТорговогоСбораЗаполнен(Параметры) Экспорт
	Если Параметры.Метаданные <> Метаданные.Документы.РегламентнаяОперация Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Параметры.ЭтоНовый Тогда
		Возврат Истина;
	КонецЕсли;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Отбор, "Ссылка, Дата, ТипОперации");
	
	Если РеквизитыДокумента.ТипОперации <> Перечисления.ТипыРегламентныхОпераций.РасчетТорговогоСбора Тогда
		Возврат Истина;
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСведений", КонецКвартала(РеквизитыДокумента.Дата));
	Запрос.УстановитьПараметр("Регистратор",  РеквизитыДокумента.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасчетТорговогоСбора.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.ПараметрыТорговыхТочек.СрезПоследних(&ДатаСведений, ) КАК ПараметрыТорговыхТочекСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасчетТорговогоСбора КАК РасчетТорговогоСбора
	|		ПО ПараметрыТорговыхТочекСрезПоследних.Организация = РасчетТорговогоСбора.Организация
	|			И ПараметрыТорговыхТочекСрезПоследних.ТорговаяТочка = РасчетТорговогоСбора.ТорговаяТочка
	|			И (РасчетТорговогоСбора.Регистратор = &Регистратор)
	|ГДЕ
	|	ПараметрыТорговыхТочекСрезПоследних.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТорговыеТочки.СнятиеСУчета)
	|	И ПараметрыТорговыхТочекСрезПоследних.ДатаПодачиУведомления < &ДатаСведений
	|	И РасчетТорговогоСбора.Регистратор ЕСТЬ NULL";
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции
 

#КонецОбласти

#КонецЕсли
